Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If things aren't broken, upgrading perl may break them (or at least issue new warnings).
es_es: Si todo funciona bien, la situación puede cambiar al actualizar perl (como mínimo pueden surgir nuevas advertencias).

source: if ( /^\D*(?!123)/ ) { # Wrong!
es_es: if ( /^\D*(?!123)/ ) { # ¡Incorrecto!

source: The following example takes advantage that C<NaN != NaN> to eliminate any C<NaN>s from the input list.
es_es: En el ejemplo siguiente se aprovecha de que C<NaN != NaN> para eliminar cualquier C<NaN> de la lista de entrada.

source: perl58delta has been added: it is the perldelta of 5.8.0, detailing the differences between 5.6.0 and 5.8.0.
es_es: perl58delta ha sido añadido: es el perldelta de 5.8.0, detallando las diferencias entre 5.6.0 y 5.8.0.

source: During the search for the end, backslashes that escape delimiters are removed (exactly speaking, they are not copied to the safe location).
es_es: Durante la búsqueda del final, las barras invertidas que escapan delimitadores son eliminados (hablando más exactamente, no se copian al lugar seguro).

source: The integer formats C<s>, C<S>, C<i>, C<I>, C<l>, C<L>, C<j>, and C<J> are inherently non-portable between processors and operating systems because they obey native byteorder and endianness.
es_es: Los formatos enteros C<s>, C<S>, C<i>, C<I>, C<l>, C<L>, C<j>, y C<J> inherentemente no portátiles entre procesadores y sistemas operativos porque siguen el orden nativo de los bytes.

source: This is because Configure relies on: 1.
es_es: Esto se debe a que Configure se basa en: 1.

source: =head2 Modifiers
es_es: =head2 Modificadores

source: Increment the version number for every change, no matter how small
es_es: Incremente el número de versión para cada cambio, por pequeño que sea

source: =item say LIST
es_es: =item say LISTA

source: perlintern Perl internal functions (autogenerated)
es_es: perlintern Funciones internas de Perl

source: These special variables are used for all kinds of purposes, and are documented in L<perlvar>.
es_es: Estas variables especiales se usan para diversos fines y se describen en L<perlvar>.

source: ISBN 978-0-596-00027-1 [3rd edition July 2000]
es_es: ISBN 978-0-596-00027-1 [3ª edición - Julio de 2000]

source: Devel::Peek: display UTF-8 SVs also as \x{...}
es_es: Devel::Peek: muestra SVs UTF-8 como \x{...}

source: (Note that lexical variables--those declared with C<my> or C<state>--will not work for this purpose; so if you're using C<my> or C<state>, specify EXPR in your call to open.)
es_es: (Tenga en cuenta que las variables léxicas -las declaradas con C<my> o C<state>- no servirán para este propósito; así que si está usando C<my> o C<state>, especifique EXPR en su llamada a open.)

source: %f a floating-point number, in fixed decimal notation
es_es: %f un número en punto flotante, en notación decimal fija

source: perl582delta Perl changes in version 5.8.2
es_es: perl582delta Cambios en la versión 5.8.2

source: Thus the platform effectively becomes a Unicode platform, hence, for example, C<\w> will match any of the more than 100_000 word characters in Unicode.
es_es: Así, la plataforma se convierte efectivamente en una plataforma Unicode, y por lo tanto, por ejemplo, C<\w> coincidirá con cualquiera de los más de 100_000 caracteres en Unicode que pueden formar parte de una "palabra".

source: In these cases, it probably pays not to trust whichever system rounding is being used by Perl, but to instead implement the rounding function you need yourself.
es_es: En estos casos, es mejor no confiar en el sistema de redondeo que está siendo utilizado por Perl, sino que en su lugar deba implementar la función de redondeo que necesite.

source: =head2 Comma Operator X<comma> X<operator, comma> X<,>
es_es: =head2 Operador coma X<comma> X<operator, comma> X<,> X<coma> X<operador, coma>

source: The comparison function is required to behave.
es_es: Se requiere que la función de comparación se comporte de forma correcta.

source: In addition, some of the modules shipped with Perl include C or XS code.
es_es: Además, algunos de los módulos distribuidos con Perl incluyen código C o XS.

source: Note that the user interface is not fully stabilized yet, and it may change until the 5.10.0 release.
es_es: Tenga en cuenta que la interfaz de usuario no está totalmente estabilizada, y puede cambiar hasta la versión 5.10.0.

source: "We're really serious about reinventing everything that needs reinventing." --Larry Wall
es_es: "Cuando hablamos de reinventar todo lo que sea necesario, no lo decimos en broma." --Larry Wall

source: A Perl developer should be able to use modules to put together the building blocks of their application.
es_es: Un programador de Perl debe ser capaz de utilizar módulos para armar los bloques de construcción de su aplicación.

source: package other;
es_es: package otro;

source: perlepoc Perl notes for EPOC
es_es: perlepoc Notas para EPOC

source: printf "<%*s>", 6, "a"; # prints "< a>"
es_es: printf "<%*s>", 6, "a"; # imprime "< a>"

source: (Note I<character>, not byte.)
es_es: (Note que es un I<carácter>, no un byte.)

source: If your input lines might end in backslashes to indicate continuation, you want to skip ahead and get the next record.
es_es: Si las líneas de entrada acaban en contra barras para indicar continuación, querrá saltarlo y obtener el siguiente registro.

source: "aa0" =~ /${b}0/; # True
es_es: "aa0" =~ /${b}0/; # Verdadero

source: =item qq/STRING/ X<qq> X<quote, double> X<"> X<"">
es_es: =item qq/CADENA/ X<qq> X<quote, double> X<"> X<""> X<comilla, doble>

source: Exceptions to this rule include C<wait>, C<waitpid>, and C<syscall>.
es_es: Excepciones a esta regla incluyen a C<wait>, C<waitpid> y C<syscall>.

source: perlstyle Perl style guide
es_es: perlstyle Guía de estilo

source: -e File exists.
es_es: -e Archivo existe.

source: =item Matching in list context
es_es: =item Coincidencia en contexto de lista

source: You don't have to close FILEHANDLE if you are immediately going to do another C<open> on it, because C<open> closes it for you.
es_es: No tiene porqué cerrar el IDENTIFICADOR_ARCHIVO si inmediatamente va a hacer otro C<open> sobre él mismo, porque C<open> lo cierra por usted.

source: In order to be portable, this behavior is not reflected by the Perl-level function C<getppid()>, that returns a consistent value across threads.
es_es: Para ser portable, este comportamiento no está reflejado en la función C<getppid()>, que devuelve un valor consistente a través de los hilos.

source: It can be used to force the engine to backtrack.
es_es: Se puede utilizar para forzar al motor a que haga una vuelta atrás.

source: C<(condition)> should be either an integer in parentheses (which is valid if the corresponding pair of parentheses matched), a look-ahead/look-behind/evaluate zero-width assertion, a name in angle brackets or single quotes (which is valid if a group with the given name matched), or the special symbol (R) (true when evaluated inside of recursion or eval).
es_es: C<(condición)> debe ser: un número entero entre paréntesis (que es válido si coincide con su correspondiente par de paréntesis); una aserción antecedente/consiguiente/evaluación de tamaño cero; un nombre entre ángulos o comillas simples (que es válido si el nombre coincide con un grupo con el mismo nombre), o el símbolo especial (R) (verdadero cuando es evaluado dentro de una recursión o eval).

source: This describes how to access the perl source using the I<git> version control system.
es_es: Describe cómo acceder al código fuente de perl con el sistema de control de versiones I<git>.

source: Use integer constants provided by the C<Socket> module for LEVEL and OPNAME.
es_es: Utilice constantes enteras proporcionadas por el módulo C<Socket> para NIVEL y OPCIÓN_NOMBRE.

source: =head2 Equality Operators X<equality> X<equal> X<equals> X<operator, equality>
es_es: =head2 Operadores de igualdad X<equality> X<equal> X<equals> X<operator, equality> X<igualdad> X<operador, igualdad>

source: See the previous example.
es_es: Ver el ejemplo anterior.

source: Separate functionality from output
es_es: Separe la funcionalidad de la salida

source: =item The empty pattern //
es_es: =item El patrón vacío //

source: "aa\x08" =~ /${b}0/; # False
es_es: "aa\x08" =~ /${b}0/; # Falso

source: will uppercase "bar", but the C</l> does not affect how the C<\U> operates.
es_es: pondrá en mayúsculas "bar", pero la C</l> no afecta a la forma en que C<\U> funciona.

source: Declare a picture format for use by the C<write> function.
es_es: Declara una imagen de formato para usar con la función C<write>.

source: Also, the C<$REGMARK> variable will be set to FALSE.
es_es: Además, la variable C<$REGMARK> se establecerá a FALSE.

source: 12 blocks actual number of blocks allocated
es_es: 12 blocks número actual de bloques reservados

source: This documentation is free; you can redistribute it and/or modify it under the same terms as Perl itself.
es_es: Esta documentación es libre; puede redistribuirla o modificarla en los mismos términos que Perl.

source: This syntax error indicates that the lexer couldn't find the final delimiter of a C<?PATTERN?> construct.
es_es: Este error de sintaxis indica que el analizador léxico no pudo encontrar el delimitador final de una construcción C<?PATRÓN?>.

source: If you just want to know how to use the utilities described here, F<pod2usage> will just extract the "USAGE" section; some of the utilities will automatically call F<pod2usage> on themselves when you call them with C<-help>.
es_es: Si sólo quiere saber cómo se usan las utilidades aquí descritas, F<pod2usage> solo extraerá la sección "USAGE" (USO); algunas de estas utilidades llamarán automáticamente a F<pod2usage> si las llama con el modificador C<-help>.

source: The internal state of the random number generator should contain more entropy than can be provided by any seed, so calling C<srand()> again actually I<loses> randomness.
es_es: El estado interno del generador de números aleatorios debería contener más entropía que la ofrecida por cualquier semilla, así que volver a llamar a srand() realmente hace I<perder> la aleatoriedad.

source: # make divide-by-zero nonfatal
es_es: # hace la división-por-cero no fatal

source: See the arguments C<debug>/C<debugcolor> in the C<use L<re>> pragma, as well as Perl's B<-Dr> command-line switch documented in L<perlrun/"Command Switches">.
es_es: Ver los argumentos C<debug>/C<debugcolor> en el pragma C<use L<re>>, así como la opción en línea de comandos de Perl B<-Dr> documentado en L<perlrun/"Opciones de comando">.

source: This document will help you Configure, build, test and install Perl on VM/ESA.
es_es: Este documento le ayudará a configurar, compilar, probar e instalar Perl en VM/ESA.

source: You might look around the net for a pre-built binary of Perl (or a C compiler!) that meets your needs, though:
es_es: También puede buscar en Internet un binario precompilado de Perl (o un compilador de C) adecuado para sus necesidades:

source: # you don't have to use the default $_ either...
es_es: # tampoco tiene que usar la variable $_ predeterminada...

source: || warn "couldn't touch $file: $!";
es_es: || warn "no puedo tocar $archivo: $!";

source: And if a regular expression is interpolated into a larger one, the original's rules continue to apply to it, and only it.
es_es: Y si una expresión regular se interpola en una más grande, las normas originales siguen siendo aplicables a ella, y solo a ella.

source: Because this is a wide-open interface, pragmas (compiler directives) are also implemented this way.
es_es: Debido a que esta es una interfaz ampliamente abierta, pragmas (directivas del compilador), también son implementadas de esta manera.

source: =head2 Symbolic Unary Operators X<unary operator> X<operator, unary>
es_es: =head2 Operadores unarios simbólicos X<unary operator> X<operator, unary> X<operador unario> X<operador, unario>

source: The C<$*> variable controlling multi-line matching has been deprecated and will be removed after 5.8.
es_es: La variable C<$*> que controla la coincidencia multi-línea ha sido desaprobada y será eliminada después de 5.8.

# Otherwise it matches any character but C< >.
source: Otherwise it matches any character but C<\n>.
es_es: De lo contrario, equivale a cualquier carácter, excepto C<\n>.

source: hello
es_es: hola

source: If VARIABLE is omitted, chops C<$_>.
es_es: Si VARIABLE se omite, recorta C<$_>.

source: First character is at offset C<0> (or whatever you've set C<$[> to (but B<<don't do that>)).
es_es: El primer carácter está en la posición C<0> (o lo que sea que haya configurado en C<$[> (pero B<no lo haga>)).

source: You can modify @ARGV before the first <> as long as the array ends up containing the list of filenames you really want.
es_es: Puede modificar @ARGV antes del primer <> siempre que el array termine conteniendo la lista de nombres de archivos que realmente quiere.

source: (Older programs did this by setting C<$*>, but this option was removed in perl 5.9.) X<^> X<$> X</m>
es_es: (Antiguos programas hacían esto estableciendo C<$*>, pero esta opción ha sido eliminada en perl 5.9.) X<^> X<$> X</m>

source: You should not use this function for rounding: one because it truncates towards C<0>, and two because machine representations of floating-point numbers can sometimes produce counterintuitive results.
es_es: No debe usar esta función para redondear: primero, porque trunca hacia C<0> y segundo, porque las representaciones máquina de números en punto flotante puede producir, algunas veces, resultados dispares.

source: my @new = sort {
es_es: my @nuevo = sort {

source: Its major features are that it's easy to use, supports both procedural and object-oriented (OO) programming, has powerful built-in support for text processing, and has one of the world's most impressive collections of third-party modules.
es_es: Se caracteriza principalmente por su facilidad de uso (permite programar tanto de manera procedural como orientada a objetos (OO)), su magnífica capacidad integrada para procesamiento de texto y por tener una de las colecciones de módulos de terceros más impresionantes del mundo.

source: # didn't
es_es: # no hacer nada

source: If you run into resistance, figure out what those people get out of the other choice and how Perl might satisfy that requirement.
es_es: Si le oponen resistencia, averigüe qué necesitan y hágales ver en qué medida Perl podría cubrir sus necesidades.

source: This used to be the preferred way to pass arrays and hashes by reference into a function, but now that we have real references, this is seldom needed.
es_es: Esta es la forma preferida para pasar arrays y hashes por referencia, a una función, pero como ahora tenemos referencias de verdad, esto es raramente necesario.

source: while (@keys) {
es_es: while (@claves) {

source: LOCK_SH requests a shared lock, LOCK_EX requests an exclusive lock, and LOCK_UN releases a previously requested lock.
es_es: LOCK_SH solicita un bloqueo compartido, LOCK_EX solicita un bloqueo exclusivo y LOCK_UN devuelve un bloqueo solicitado previamente.

source: Choose wisely.
es_es: Elija con cuidado.

source: This is useful for representing Unicode strings, and for comparing version "numbers" using the string comparison operators, C<cmp>, C<gt>, C<lt> etc. If there are two or more dots in the literal, the leading C<v> may be omitted.
es_es: Esto es útil para la representación de cadenas Unicode, y para comparar la versión "en números" que utilizan los operadores de comparación de cadenas, C<cmp>, C<gt>, C<lt>, etc. Si hay dos o más puntos en el literal, el prefijo C<v> puede omitirse.

source: Scalar values are always named with '$', even when referring to a scalar that is part of an array or a hash.
es_es: Los valores escalares se nombran siempre con '$', incluso cuando se accede a un escalar que es parte de un array o un hash.

source: The mode you specify should match the mode of the original filehandle.
es_es: El modo que especifique debe coincidir con el modo del identificador de archivo original.

source: Perl 5.6 and earlier used a quicksort algorithm to implement sort.
es_es: Perl v5.6 y anteriores usaban un algoritmo quicksort para implementar sort.

source: -B File is a "binary" file (opposite of -T).
es_es: -B archivo es un archivo "binario" (opuesto de -T).

source: For Irix 6.2 with perl threads, you have to have the following patches installed:
es_es: En Irix 6.2 con hilos perl, tiene que tener los siguientes parches instalados:

source: Updated to version 1.77
es_es: Actualizado a la versión 1.77

source: =head2 Running Perl programs
es_es: =head2 Ejecución de programas Perl

source: See L<perlinterp> for more details on the files that make up the Perl interpreter, as well as details on how it works.
es_es: En L<perlinterp> encontrará más información sobre los archivos que integran el intérprete de Perl y detalles sobre el funcionamiento del intérprete.

source: =head2 Slices
es_es: =head2 Porciones

source: If the delimiter is C</>, one cannot get the combination C<\/> into the result of this step.
es_es: Si el delimitador es C</>, no se puede obtener la combinación C<\/> en el resultado de este paso.

source: =item s/PATTERN/REPLACEMENT/msixpodualgcer X<substitute> X<substitution> X<replace> X<regexp, replace> X<regexp, substitute> X</m> X</s> X</i> X</x> X</p> X</o> X</g> X</c> X</e> X</r>
es_es: =item s/PATRÓN/REEMPLAZO/msixpodualgcer X<substitute> X<substitution> X<replace> X<regexp, replace> X<regexp, substitute> X</m> X</s> X</i> X</x> X</p> X</o> X</g> X</c> X</e> X</r> X<sustitución> X<reemplazo> X<regexp, reemplazo> X<reemplazo, sustitución>

source: The most generic form possible is usually a Perl data structure which can then be used to generate a text report, HTML, XML, a database query, or whatever else your users require.
es_es: La forma más genérica posible, es por lo general una estructura de datos Perl, que puede ser utilizado para generar un informe de texto, HTML, XML, una consulta de base de datos o cualquier otra cosa que necesiten los usuarios.

source: The obtained perl isn't binary compatible with a regular perl 5.9.4, and has space and speed penalties; moreover not all regression tests still pass with it.
es_es: El perl obtenido no es compatible a nivel binario con una versión normal de perl 5.9.4, y tiene problemas de espacio y velocidad; además, todavía no pasa todas las pruebas de regresión.

source: For various reasons C<\K> may be significantly more efficient than the equivalent C<< (?<=...) >> construct, and it is especially useful in situations where you want to efficiently remove something following something else in a string.
es_es: Por diversas razones C<\K> puede ser significativamente más eficiente que la construcción equivalente C<< (?<=...) >>, y esto es especialmente útil en situaciones donde usted quiere, eficientemente, quitar algo que siga a otra cosa, dentro de una cadena.

source: The four C<filter_*> methods shown above are available in all the DBM modules that ship with Perl, namely DB_File, GDBM_File, NDBM_File, ODBM_File and SDBM_File.
es_es: Los cuatro métodos C<filter_*> mostrados arriba están disponibles en todos los módulos DBM incluidos en Perl: DB_File, GDBM_File, NDBM_File, ODBM_File y SDBM_File.

source: Modifying an assignment is equivalent to doing the assignment and then modifying the variable that was assigned to.
es_es: Modificando una asignación es equivalente a realizar la asignación y luego modificando la variable que le fue asignada.

source: ($folks[0], $folks[-1]) = ($folks[-1], $folks[0]);
es_es: ($gente[0], $gente[-1]) = ($gente[-1], $gente[0]);

source: If it returns the empty string, use C<getpwuid>.
es_es: Si devuelve la cadena vacía, utilice C<getpwuid>.

source: B<Perl has never guaranteed any ordering of the hash keys>, and the ordering has already changed several times during the lifetime of Perl 5.
es_es: B<Perl nunca ha garantizado ningún tipo de ordenación de las claves de un hash>, y esa ordenación ya ha cambiado varias veces a lo largo de la vida útil de Perl 5.

source: The semantics of C<use feature :5.10*> have changed slightly.
es_es: La semántica de C<use feature :5.10*> ha cambiado ligeramente.

source: The binary operators C<+> C<-> C<*> C</> C<%> C<==> C<!=> C<E<gt>> C<E<lt>> C<E<gt>=> C<E<lt>=> and the unary operators C<-> C<abs> and C<--> will attempt to convert arguments to integers.
es_es: Los operadores binarios C<+> C<-> C<*> C</> C<%> C<==> C<!=> C<E<gt>> C<E<lt>> C<E<gt>=> y C<E<lt>=>, y los operadores unarios C<abs> y C<-->, intentan convertir los argumentos en enteros.

source: Bugs in OS/2 sockets and tmpfile have been fixed.
es_es: Errores corregidos en sockets en OS/2 y tmpfile.

source: document that use utf8 is not the right way most of the time
es_es: documentar que el uso de UTF-8 no es la manera correcta en la mayoría de las ocasiones

source: 4: got ABC
es_es: 2: tenemos ABC

source: If multiple parentheses have the same name, then it recurses to the leftmost.
es_es: Si múltiples paréntesis tienen el mismo nombre, entonces re-ejecuta el que esté más a la izquierda.

source: The timeout, if specified, is in seconds, which may be fractional.
es_es: El tiempo de espera, si se especifica, en segundos, puede ser decimal.

source: Braces are safer when creating a regex by concatenating smaller strings.
es_es: Las llaves son más seguras al crear una expresión regular mediante la concatenación de cadenas más pequeñas.

source: Look-behind matches text up to the current match position, look-ahead matches text following the current match position.
es_es: Lo antecedente (I<Look-behind>) coincide con texto hasta la actual posición de coincidencia, lo consiguiente (I<look-ahead>) coincide con texto que sigue a la actual posición de coincidencia.

source: Thus C<next> will exit such a block early.
es_es: Por lo tanto C<next> saldrá del primer bloque.

source: Beyond that, you have to consider several things and decide which is best for you.
es_es: Si desea usar otras versiones, para decidir cuál es la que más le conviene debe tener en cuenta varias cosas, como las siguientes:

source: Perl 5.8.0 forgot to add some deprecation warnings, these warnings have now been added.
es_es: Perl 5.8.0 olvidó añadir algunas advertencias de desaprobación, estas advertencias han sido ahora añadidas.

source: perlsyn Perl syntax
es_es: perlsyn Sintaxis

source: Documentation fix
es_es: Arreglo en la documentación

source: Code such as
es_es: Código como este

source: They can also have C<Content-Length> to indicate the number of I<bytes>, which is always a good idea to supply if the number is known.
es_es: También se puede utilizar C<Content-Length> para indicar el número de I<bytes>, un dato que siempre viene bien conocer.

source: As an alternative to the above, you may prefer to throw exceptions using the Error module.
es_es: Como alternativa a lo anterior, es posible que prefiera lanzar excepciones utilizando el módulo Error.

source: For full details see the file F<README.win32>, particularly if you're running Win95.
es_es: Para más detalles vea el archivo F<README.win32>, sobre todo si está ejecutando Win95.

source: The meaning of C<open> with more than three arguments for non-pipe modes is not yet defined, but experimental "layers" may give extra LIST arguments meaning.
es_es: El significado de C<open> con más de tres argumentos para modos no entubados aún no está definido, pero "capas" experimentales puede dar significados adicionales a la LISTA de argumentos adicionales.

source: =head2 Experimental Support for Sun Studio Compilers for Linux OS
es_es: =head2 Soporte Experimental para compiladores Sun Studio para sistemas operativos Linux
